
## Terraform plan for environment: `int`

**Commit:** 19c98c9c97370f642ae20820fc7d42c0a4d7ddd4


**API version:** 790df66870
**CLI version:** 790df66870
**Selfserve version:** 790df66870
**Internal version:** 790df66870

### Plan summary

`2 to add, 45 to change, 0 to destroy`

**🆕 Creates**

```tf
module.service.aws_sqs_queue.main
module.service.aws_sqs_queue.sqs-deadletter-queue
```
**🔄 Updates**

```tf
module.service.module.batch.aws_batch_job_definition.this["cancel-unsubmitted-bilateral"]
module.service.module.batch.aws_batch_job_definition.this["ch-vs-olcs-diffs"]
module.service.module.batch.aws_batch_job_definition.this["clean-up-variations"]
module.service.module.batch.aws_batch_job_definition.this["close-expired-windows"]
module.service.module.batch.aws_batch_job_definition.this["cns"]
module.service.module.batch.aws_batch_job_definition.this["company-profile-dlq"]
module.service.module.batch.aws_batch_job_definition.this["create-psv-licence-surrender-task"]
module.service.module.batch.aws_batch_job_definition.this["data-retention-delete"]
module.service.module.batch.aws_batch_job_definition.this["data-retention-populate"]
module.service.module.batch.aws_batch_job_definition.this["data-retention-postcheck"]
module.service.module.batch.aws_batch_job_definition.this["data-retention-precheck"]
module.service.module.batch.aws_batch_job_definition.this["database-maintenance"]
module.service.module.batch.aws_batch_job_definition.this["digital-continuation-reminders"]
module.service.module.batch.aws_batch_job_definition.this["duplicate-vehicle-warning"]
module.service.module.batch.aws_batch_job_definition.this["enqueue-ch-compare"]
module.service.module.batch.aws_batch_job_definition.this["expire-bus-registration"]
module.service.module.batch.aws_batch_job_definition.this["flag-urgent-tasks"]
module.service.module.batch.aws_batch_job_definition.this["import-users-from-csv"]
module.service.module.batch.aws_batch_job_definition.this["inspection-request-email"]
module.service.module.batch.aws_batch_job_definition.this["interim-end-date-enforcement"]
module.service.module.batch.aws_batch_job_definition.this["international-goods-export"]
module.service.module.batch.aws_batch_job_definition.this["last-tm-letter"]
module.service.module.batch.aws_batch_job_definition.this["licence-status-rules"]
module.service.module.batch.aws_batch_job_definition.this["mark-expired-permits"]
module.service.module.batch.aws_batch_job_definition.this["process-cl"]
module.service.module.batch.aws_batch_job_definition.this["process-company-profile"]
module.service.module.batch.aws_batch_job_definition.this["process-inbox"]
module.service.module.batch.aws_batch_job_definition.this["process-insolvency"]
module.service.module.batch.aws_batch_job_definition.this["process-insolvency-dlq"]
module.service.module.batch.aws_batch_job_definition.this["process-ntu"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-community-licences"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-disc-generation"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-disc-print"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-ecmt-accept"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-general"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-irhp-allocate"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-permit-generation"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-permit-print"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-print"]
module.service.module.batch.aws_batch_job_definition.this["psv-operator-list-export"]
module.service.module.batch.aws_batch_job_definition.this["remove-read-audit"]
module.service.module.batch.aws_batch_job_definition.this["resolve-payments"]
module.service.module.batch.aws_batch_job_definition.this["system-parameter"]
module.service.module.batch.aws_batch_job_definition.this["transxchange-consumer"]
module.service.module.eventbridge_sns.aws_cloudwatch_event_target.this["batch-fail-event"]
```


----

<details data-gh-workflow="int-environment-plan"><summary>Show full plan</summary>

```tf


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.service.aws_sqs_queue.main will be created
  + resource "aws_sqs_queue" "main" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + max_message_size                  = 262144
      + message_retention_seconds         = 345600
      + name                              = "vol-app-int-batch-failure-queue"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + sqs_managed_sse_enabled           = (known after apply)
      + tags_all                          = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 30
    }

  # module.service.aws_sqs_queue.sqs-deadletter-queue will be created
  + resource "aws_sqs_queue" "sqs-deadletter-queue" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + max_message_size                  = 262144
      + message_retention_seconds         = 345600
      + name                              = "vol-app-int-batch-failure-dlq"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + sqs_managed_sse_enabled           = (known after apply)
      + tags_all                          = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 30
    }

  # module.service.module.batch.aws_batch_job_definition.this["cancel-unsubmitted-bilateral"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-cancel-unsubmitted-bilateral:31"
        name                       = "vol-app-int-cancel-unsubmitted-bilateral"
        tags                       = {}
      ~ tags_all                   = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
        # (12 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["ch-vs-olcs-diffs"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-ch-vs-olcs-diffs:31"
        name                       = "vol-app-int-ch-vs-olcs-diffs"
        tags                       = {}
      ~ tags_all                   = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
        # (12 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["clean-up-variations"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-clean-up-variations:31"
        name                       = "vol-app-int-clean-up-variations"
        tags                       = {}
      ~ tags_all                   = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
        # (12 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["close-expired-windows"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-close-expired-windows:31"
        name                       = "vol-app-int-close-expired-windows"
        tags                       = {}
      ~ tags_all                   = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
        # (12 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["cns"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-cns:31"
        name                       = "vol-app-int-cns"
        tags                       = {}
      ~ tags_all                   = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
        # (12 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["company-profile-dlq"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-company-profile-dlq:31"
        name                       = "vol-app-int-company-profile-dlq"
        tags                       = {}
      ~ tags_all                   = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
        # (12 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["create-psv-licence-surrender-task"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-create-psv-licence-surrender-task:31"
        name                       = "vol-app-int-create-psv-licence-surrender-task"
        tags                       = {}
      ~ tags_all                   = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
        # (12 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["data-retention-delete"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-data-retention-delete:31"
        name                       = "vol-app-int-data-retention-delete"
        tags                       = {}
      ~ tags_all                   = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
        # (12 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["data-retention-populate"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-data-retention-populate:31"
        name                       = "vol-app-int-data-retention-populate"
        tags                       = {}
      ~ tags_all                   = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
        # (12 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["data-retention-postcheck"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-data-retention-postcheck:31"
        name                       = "vol-app-int-data-retention-postcheck"
        tags                       = {}
      ~ tags_all                   = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
        # (12 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["data-retention-precheck"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-data-retention-precheck:31"
        name                       = "vol-app-int-data-retention-precheck"
        tags                       = {}
      ~ tags_all                   = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
        # (12 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["database-maintenance"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-database-maintenance:31"
        name                       = "vol-app-int-database-maintenance"
        tags                       = {}
      ~ tags_all                   = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
        # (12 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["digital-continuation-reminders"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-digital-continuation-reminders:31"
        name                       = "vol-app-int-digital-continuation-reminders"
        tags                       = {}
      ~ tags_all                   = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
        # (12 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["duplicate-vehicle-warning"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-duplicate-vehicle-warning:31"
        name                       = "vol-app-int-duplicate-vehicle-warning"
        tags                       = {}
      ~ tags_all                   = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
        # (12 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["enqueue-ch-compare"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-enqueue-ch-compare:31"
        name                       = "vol-app-int-enqueue-ch-compare"
        tags                       = {}
      ~ tags_all                   = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
        # (12 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["expire-bus-registration"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-expire-bus-registration:31"
        name                       = "vol-app-int-expire-bus-registration"
        tags                       = {}
      ~ tags_all                   = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
        # (12 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["flag-urgent-tasks"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-flag-urgent-tasks:31"
        name                       = "vol-app-int-flag-urgent-tasks"
        tags                       = {}
      ~ tags_all                   = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
        # (12 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["import-users-from-csv"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-import-users-from-csv:31"
        name                       = "vol-app-int-import-users-from-csv"
        tags                       = {}
      ~ tags_all                   = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
        # (12 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["inspection-request-email"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-inspection-request-email:31"
        name                       = "vol-app-int-inspection-request-email"
        tags                       = {}
      ~ tags_all                   = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
        # (12 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["interim-end-date-enforcement"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-interim-end-date-enforcement:31"
        name                       = "vol-app-int-interim-end-date-enforcement"
        tags                       = {}
      ~ tags_all                   = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
        # (12 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["international-goods-export"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-international-goods-export:31"
        name                       = "vol-app-int-international-goods-export"
        tags                       = {}
      ~ tags_all                   = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
        # (12 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["last-tm-letter"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-last-tm-letter:31"
        name                       = "vol-app-int-last-tm-letter"
        tags                       = {}
      ~ tags_all                   = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
        # (12 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["licence-status-rules"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-licence-status-rules:31"
        name                       = "vol-app-int-licence-status-rules"
        tags                       = {}
      ~ tags_all                   = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
        # (12 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["mark-expired-permits"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-mark-expired-permits:31"
        name                       = "vol-app-int-mark-expired-permits"
        tags                       = {}
      ~ tags_all                   = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
        # (12 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["process-cl"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-process-cl:31"
        name                       = "vol-app-int-process-cl"
        tags                       = {}
      ~ tags_all                   = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
        # (12 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["process-company-profile"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-process-company-profile:31"
        name                       = "vol-app-int-process-company-profile"
        tags                       = {}
      ~ tags_all                   = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
        # (12 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["process-inbox"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-process-inbox:31"
        name                       = "vol-app-int-process-inbox"
        tags                       = {}
      ~ tags_all                   = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
        # (12 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["process-insolvency"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-process-insolvency:31"
        name                       = "vol-app-int-process-insolvency"
        tags                       = {}
      ~ tags_all                   = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
        # (12 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["process-insolvency-dlq"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-process-insolvency-dlq:31"
        name                       = "vol-app-int-process-insolvency-dlq"
        tags                       = {}
      ~ tags_all                   = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
        # (12 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["process-ntu"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-process-ntu:31"
        name                       = "vol-app-int-process-ntu"
        tags                       = {}
      ~ tags_all                   = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
        # (12 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["process-queue-community-licences"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-process-queue-community-licences:31"
        name                       = "vol-app-int-process-queue-community-licences"
        tags                       = {}
      ~ tags_all                   = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
        # (12 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["process-queue-disc-generation"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-process-queue-disc-generation:31"
        name                       = "vol-app-int-process-queue-disc-generation"
        tags                       = {}
      ~ tags_all                   = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
        # (12 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["process-queue-disc-print"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-process-queue-disc-print:31"
        name                       = "vol-app-int-process-queue-disc-print"
        tags                       = {}
      ~ tags_all                   = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
        # (12 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["process-queue-ecmt-accept"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-process-queue-ecmt-accept:31"
        name                       = "vol-app-int-process-queue-ecmt-accept"
        tags                       = {}
      ~ tags_all                   = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
        # (12 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["process-queue-general"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-process-queue-general:31"
        name                       = "vol-app-int-process-queue-general"
        tags                       = {}
      ~ tags_all                   = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
        # (12 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["process-queue-irhp-allocate"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-process-queue-irhp-allocate:31"
        name                       = "vol-app-int-process-queue-irhp-allocate"
        tags                       = {}
      ~ tags_all                   = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
        # (12 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["process-queue-permit-generation"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-process-queue-permit-generation:31"
        name                       = "vol-app-int-process-queue-permit-generation"
        tags                       = {}
      ~ tags_all                   = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
        # (12 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["process-queue-permit-print"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-process-queue-permit-print:31"
        name                       = "vol-app-int-process-queue-permit-print"
        tags                       = {}
      ~ tags_all                   = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
        # (12 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["process-queue-print"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-process-queue-print:31"
        name                       = "vol-app-int-process-queue-print"
        tags                       = {}
      ~ tags_all                   = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
        # (12 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["psv-operator-list-export"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-psv-operator-list-export:31"
        name                       = "vol-app-int-psv-operator-list-export"
        tags                       = {}
      ~ tags_all                   = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
        # (12 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["remove-read-audit"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-remove-read-audit:31"
        name                       = "vol-app-int-remove-read-audit"
        tags                       = {}
      ~ tags_all                   = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
        # (12 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["resolve-payments"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-resolve-payments:31"
        name                       = "vol-app-int-resolve-payments"
        tags                       = {}
      ~ tags_all                   = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
        # (12 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["system-parameter"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-system-parameter:31"
        name                       = "vol-app-int-system-parameter"
        tags                       = {}
      ~ tags_all                   = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
        # (12 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["transxchange-consumer"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-transxchange-consumer:31"
        name                       = "vol-app-int-transxchange-consumer"
        tags                       = {}
      ~ tags_all                   = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
        # (12 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.eventbridge_sns.aws_cloudwatch_event_target.this["batch-fail-event"] will be updated in-place
  ~ resource "aws_cloudwatch_event_target" "this" {
        id             = "vol-app-int-batch-failure-event-rule-terraform-20241009154107992900000001"
        # (8 unchanged attributes hidden)

      ~ dead_letter_config (known after apply)
    }

Plan: 2 to add, 45 to change, 0 to destroy.

```

</details>